{
  "common": {
    "app_title": "Student Version",
    "unauthorized_main": "Unauthorized!",
    "unauthorized_secondary": "You are being redirected to another page...",
    "redirecting_main": "Please Hold On!",
    "notfound_main": "Oops!",
    "notfound_secondary": "Error 404: Page Not Found",
    "notfound_button": "Back To Home",
    "language": "Language",
    "religion": "Religion",
    "login": "Sign In",
    "logout": "Sign Out",
    "edit": "Edit",
    "add": "Add",
    "delete": "Delete",
    "save": "Save",
    "cancel": "Reset",
    "loading": "Loading",
    "nodata": "No Data to show",
    "nosearch": "No Search Results",
    "level1": "Level 1",
    "select": "Choose an Option",
    "future": "Future Work",
    "eng_name": "English Name",
    "ar_name": "Arabic Name",
    "firstTerm": "First Semester",
    "secondTerm": "Second Semester",
    "summerTerm": "Summer Semester",
    "gpaFrom": "GPA From ",
    "gpaTo": "GPA To",
    "choice_yes": "Yes",
    "choice_no": "No",
    "lecture": "Lecture",
    "lab": "Lab",
    "section": "Section",
    "day": "Day",
    "period": "Period",
    "time": "Time",
    "search": "Search..",
    "continue": "Continue",
    "gender": "Gender",
    "birthplace": "Birthplace",
    "birthdate": "Birthdate",
    "nationality": "Nationality",
    "otherNationality": "Other Nationality",
    "nationalId": "National ID",
    "marital": "Marital Status",
    "address": "Address",
    "phone": "Mobile Number",
    "mail": "E-mail",
    "box": "Mail Box",
    "system": "System Mail",
    "homeNumber": "Home Number",
    "city": "City",
    "directorate": "Directorate",
    "guardianName": "Guardian Name",
    "guardianMail": "Guardian E-mail",
    "guardianJob": "Guardian Job",
    "guardianPhone": "Guardian Phone Number",
    "guardianAddress": "Guardian Address",
    "guardianNationality": "Guardian Nationality",
    "prevQualification": "Previous Qualification",
    "prevQualificationInstitute": "Previous Qualification Institute",
    "precentage": "Precentage",
    "enrollmentYear": "Enrollment Year",
    "enrollmentEndDate": "Enrollment End Date",
    "totalPrevQualification": "Total Previous Qualification",
    "recruitmentState": "Recruitment State",
    "recruitmentNumber": "Recruitment Number",
    "recruitmentDate": "Recruitment Date",
    "armyNumber": "Army Number",
    "schoolMarks": "School Marks",
    "schoolSeat": "Seat ID",
    "regCourses": "Registered Courses",
    "addCourse": "Add Course",
    "editCourse": "Edit Course",
    "coursesNotReg": "Courses Not Registered",
    "enterValue": "Enter a Value..",
    "invalidCred": "Invalid Credentials",
    "from": "From",
    "to": "To",
    "profile": "Profile",
    "lecturer": "Lecturer",
    "place": "Place",
    "universityName": "Suez Canal University",
    "portal": "Portal",
    "name": "Name",
    "department": "Department",
    "level": "Level",
    "program": "Program",
    "add/delete": "Add/Delete",
    "startPeriod": "Start Period",
    "endPeriod": "End Period",
    "smartAssistant": "Smart Assistant",
    "error": "Something went wrong, please try again later",
    "close": "Close",
    "quiz": "Quizzes"
  },
  "login": {
    "email": "E-mail",
    "password": "Password",
    "forget": "Forgot Your Password?",
    "title": "Welcome To Suez Canal University",
    "button": "Login",
    "subtitle": "LOGIN"
  },
  "reset": {
    "new-pswrd": "New Password",
    "conf-pswrd": "Confirm Password",
    "button": "Reset",
    "subtitle": "Reset Password"
  },
  "forget": {
    "email": "E-mail",
    "button": "Send",
    "subtitle": "Forgot Your Password?"
  },
  "gtEmail": {
    "NatID": "National ID",
    "button": "Send",
    "subtitle": "Please  enter your national ID"
  },
  "payment": {
    "header": "You Have To Pay",
    "ccn": "Card Number",
    "ccnTxt": "Please enter the 16-digit number on your card",
    "cvv": "CVV",
    "cvvTxt": "Enter the 3-digit number on the back of your card",
    "date": "Expiry Date",
    "password": "Enter Your Acadimic Password",
    "button": "Pay Now",
    "choose": "Choose Payment Method",
    "wallet": "Wallet",
    "credit": "Credit Card",
    "phoneError": "Please enter a valid phone number",
    "payment": "Payment",
    "koshk": "Kiosk",
    "koshkTitle": "Kiosk Payment",
    "billRef": "Bill Reference",
    "amount": "Amount",
    "notes": "Notes",
    "koshkMsg": "Go to the nearest kiosk, ask for Madfouaat Mutanouea Accept and give your reference number.",
    "usingWallet": "Payment using Wallet",
    "success": "Payment Successful!",
    "redirecting": "Redirecting to the another page",
    "seconds": "seconds",
    "failed": "Payment Failed!"
  },
  "week": {
    "saturday": "Saturday",
    "sunday": "Sunday",
    "monday": "Monday",
    "tuesday": "Tuesday",
    "wednesday": "Wednesday",
    "thursday": "Thursday",
    "friday": "Friday"
  },
  "levels": {
    "0": "Level 1",
    "1": "Level 2",
    "2": "Level 3",
    "3": "Level 4",
    "4": "Level 5"
  },
  "staff": {
    "container-1-title": "Induction",
    "container-1-text": "The induction event/session is your start point in the process of becoming familiar with, and settling into, University life. During your induction session you will be introduced to your workplace, team, and supervisors. you will be informed with your duties and schedules. Also, you will be handed your ID card, username, and passwords of the professors-related digital platforms. Your induction session is your opportunity to investigate, to ask questions, and to introduce yourself to the employees. Always feel free to explore your environment, and ask for help if needed.",
    "container-2-title": "Accommodation / Staff Housing",
    "container-2-text": "Suez Canal University provides the academic staff with housing services. The service is manifested in the tutors Lounge located in El-Sheikh Zayed district next to the International Swimming pool in in Ismailia. The lounge consists of 2 blocks that have a total of 45 rooms with a housing capacity of 180 residents. To qualify for admission, applicants must complete all secondary school graduation requirements, maintain a high level of academic performance and submit all required documents before the set deadlines. Having the minimum academic requirements does not guarantee admission to the University, but rather ensures entry to the selection process. There is a minimum level of academic achievement for each faculty that is decided by the supreme council of universities each year.",
    "container-3-title": "How To Apply",
    "container-4-title": "Professional Development",
    "container-3-list-title": "The Library aspires to be the main source of intellectual and civilized knowledge, with its sources of information in science and culture as well as its material and human capabilities and support services in the advancement of knowledge and research movement and the development of the educational process. Library services:",
    "container-4-list-title": "Available courses:"
  },
  "undergraduate": {
    "container-1-text": "Suez Canal University is the leading educational and research institution in the Canal Region. Our academic status of glory has not been earned/accomplished overnight. As the university, since its establishment, has been more than keen to offer its attendees an outstanding opportunity to learn, develop, and succeed. Suez Canal University has recruited both of its campuses, the old and new ones, to support its mission and vision of continuous learning.SCU has the doors wide open for both the national and international students to join in for either a bachelor’s degree or postgraduate degree. The scope of learning is not limited to undergraduate education. On the contrary, it has extended to include postgraduate education as well, making Suez Canal University an Egyptian educational institution of remarkable variation in the offered levels of education and the awarded certificates.We aim to offer our students value, knowledge, and scientific power to make a positive change in the world. No matter what your scope of study is, your major subject or interest might be, you will find the right program for you, as SCU has 20 faculties operating on its campus.",
    "container-2-title": "Diploma Conditions ",
    "container-3-title": "Required Documents"
  },

  "student": {
    "info": "Student Info",
    "home": "Home",
    "courses": "Available Courses",
    "Registration": "Registration",
    "progress": "Student Progress",
    "desire": "Program Desires",
    "grades": "Courses grades",
    "fees": "Fees Payment",
    "name": "Student Name",
    "id": "Student ID",
    "department": "Department",
    "project_hrs": "Project Hours",
    "elective_hrs": "Passed Elective Hours",
    "mandatory_hrs": "Passed Mandatory Hours",
    "req_hrs": "Total Required Hours",
    "passed_hrs": "Total Passed Hours",
    "registered_hrs": "Total Registered Hours",
    "gpa": "Accumulated GPA",
    "allowed_hrs": "Allowed Hours",
    "advisor": "Academic Advisor",
    "allowed_courses": "Allowed Courses",
    "schedule": "Schedule",
    "receipts": "Receipts",
    "quiz": "Quizzes",
    "chat": "Chat"
  },
  "info": {
    "personal": "Personal Info",
    "family": "Family Info",
    "contact": "Contact Info",
    "pre": "Pre-Qualification Info"
  },
  "courses": {
    "code": "Code",
    "name": "Course Name",
    "en_name": "English Name",
    "ar_name": "Arabic Name",
    "hours": "Hours",
    "type": "Type",
    "pre": "Prerequisite Code",
    "passed": "Passed",
    "registeration": "Registeration",
    "available": "Available Courses"
  },
  "enums": {
    "MALE": "Male",
    "FEMALE": "Female",
    "SINGLE": "Single",
    "MARRIED": "Married",
    "DIVORCED": "Divorced",
    "WIDOWED": "Widowed",
    "SEPARATED": "Separated",
    "CHRISTIAN": "Christian",
    "MUSLIM": "Muslim",
    "MANDATORY": "Mandatory",
    "ELECTIVE": "Elective",
    "null": "Undefined"
  },
  "home": {
    "staff": "Staff and employees",
    "postgraduate": "Postgraduate",
    "undergraduate": "Undergraduate",
    "international": "International",
    "aboutUs": "About Us",
    "aboutUsDescription": "SCU is a community of talented students, teachers, and researchers. In addition to, a wide range of professional, administrative support and service staff; all of whom are committed to help change this world for the better. Also, we encourage each other to work hard, not only to earn degrees or public recognition, but also to be leaders in this changing world",
    "contactUs": "Contact Us",
    "training": "Training Courses and E-Learning",
    "services": "University Services",
    "more": "More",
    "managementUnit": "Managment information systems unit services",
    "managementUnitNews": "Book training for the basics of digital transformation certificate for postgraduate studies abroad at Suez Canal University",
    "HR": "Human Resourse Development",
    "HRNews": "Developing the skills of faculty members and students in order to develop the educational and research process at Suez Canal University",
    "eLearning": "E-Learning Unit",
    "eLearningNews": "Supporting e-learning by converting university courses into electronic courses and broadcasting them on the university’s website, and spreading the culture of e-learning",
    "digitalTrans": "Certificate in Fundamentals of Digital Transformation",
    "latestNews": "Latest News & Upcoming ",
    "events": "Events",
    "newsDates": "March,2023",
    "news": "Towards future education in the light of sustainable development… The fourth conference for educational and applied research for postgraduate studies will start tomorrow"
  },
  "landing": {
    "welcome": "Welcome to Suez Canal University",
    "welcomeTextOne": "From your professors to your friends and teammates, Suez Canal University is a vibrant community where you can always feel supported and encouraged. No matter where you come from, this university is home and is designed to help you learn about life and work. Suez Canal University has 16 faculties and 4 Institutes which allow students choose freely between multiple varieties.",
    "welcomeTextTwo": "SCU is a community of talented students, teachers, and researchers. In addition to a wide range of professional, administrative support and service staff; all of whom are committed to help change this world for the better. Also, we encourage each other to work hard, not only to earn degrees or public recognition, but also to be leaders in this changing world. SCU seeks to prepare students for our diverse and connected world by creating an inclusive educational experience and a culture that respects the dignity of each individual on our campus. We are looking forward be an inclusive university that addresses",
    "secondContainer1": "Applicants must complete all secondary school graduation requirements, maintain a high level of academic performance and submit all required documents before the set deadlines. Having the minimum academic requirements does not guarantee admission to the University, but rather ensures entry to the selection process. There is a minimum level of academic achievement for each faculty that is decided by the supreme council of universities each year.",
    "secondContainer2": "SCU offers outstanding undergraduate curricula to its students. Those programs are instructed by exceptional professors, PhD holders and scholars of internationally recognized research and academic institutes. We are proud to have a unique and well qualified staff that brings perfection to our students and to our institute.",
    "secondContainerTitle1": "How to Qualify",
    "secondContainerTitle2": "for Admission",
    "thirdcontainerText": "To qualify for admission, applicants must complete secondary school graduation requirements and submit all required documents before the deadline to Join SCU for the academic year. Here are the documents needed to join us at SCU: ",
    "thirdcontainerStep1": "1. Original Secondary-year school Certificate",
    "thirdcontainerStep2": "2. Original Birth Certificate ",
    "thirdcontainerStep3": "3. 10 recent personal photos ",
    "thirdcontainerStep4": "4. The original military ID for male students who are above 19 years (Namouzag 6 Gond)",
    "thirdcontainerStep5": "5. Military Service Form (Namouzag 2 Gond), for Egyptian male students only ",
    "thirdcontainerStep6": "6. A copy of the students' national ID card. ",
    "thirdcontainerStep7": "7. A Medical report stamped by the Medical sector of the Egyptian Ministry of Higher Education The student must fill this application form and submit it before the due date",
    "thirdcontainerTitle": "How to Apply"
  },
  "admission": {
    "firstcontainer1": "We aim to offer our academic knowledge not only to our Egyptian students, but also to whoever feels the need to learn, develop, and succeed. At SCU, we aspire to supply our students with the knowledge to help change the world. We have twenty faculties actively operating on SCU old and new campuses, simultaneously, all to guarantee an organized process of continuous learning and innovation.",
    "firstcontainer2": "At SCU, you are free to explore the major you would like to know in depth.",
    "admissionTitle": "Admission Requirements",
    "admission1": "1. An equivalent certificate of the latest academic qualification awarded by the supreme council of universities in Egypt.",
    "admission2": "2. A letter of candidacy from the country the student comes from to the faculty the student wishes to study at, clarifying the providing body, the university year in which the student wishes to study, and the degree abstained by the student.",
    "admission3": "3. A copy of the student's passport that is valid for one whole year.",
    "admission4": "4. A document which proves that the student does not have AIDS. before seeking admission or registration.",
    "admission5": "5. An Excellence certificate valid for one one year for medicine students",
    "admission6": "6. Filling the application forms at the desired faculty.",
    "admission7": "7. Four personal photos.",
    "admission8": "8.The grades of the four-year bachelor (for master's degree)",
    "admission9": "9. A diploma or pre-master certificate (for Ph.D.)",
    "admissionFinalText": "After fulfilling all previous requirements, an original copy of an Information form and three photocopies of it have to be submitted with the student's signature on them. Enclosing a photocopy of the approval embassy's approval of the student's study at the desired faculty, clarifying the providing body, the university year in which the student wishes to study and the degree the student wishes to take."
  },
  "landingNav": {
    "home": "Home",
    "colleges": "Colleges & Departments",
    "faculties": "Faculties & Institutes",
    "research": "Research",
    "center": "Centers & Units",
    "new": "News",
    "admission_info": "Admission Info"
  },
  "diplomaConditions": {
    "1": "The student must hold a bachelor's degree from one of the universities recognized by the supreme council of universities.",
    "2": "The student must meet the conditions of admission as well as the department's approval.",
    "3": "The student must submit a hard copy of the required documents at the administration's building and then submit a soft copy through the admission from on the website.",
    "4": "The student selects the appropriate courses and updates the registration form, then passes it to the academic advisor and the head of the specialized scientific department for accreditation. Eventually, the vice dean for postgraduate studies and research approves of the form.",
    "5": "If the student meets the admission criteria, he/she will not be admitted until the tuition fees are paid.",
    "6": "Payment of tuition fees is a must for the student to be allowed to attend and record courses.",
    "7": "A student who still has not selected his/her courses of study after the last week of the spring semester and the first week of the summer semester will not be allowed to attend lectures.",
    "8": "The institute/faculty council may, on the recommendation of the department council, accept the registration of a student who holds a bachelor's degree in a specialization not related to the department after passing several supplementary courses at the Bachelor level established by the competent section board.",
    "9": "If the number of the assigned courses exceeds four, the institute/faculty will offer the student a preparatory year for qualification. The year will not be counted among the official years of study."
  },
  "reqDocuments": {
    "1": "Bachelor's degree certificate + a copy.",
    "2": "Certificate of subject's grades + a copy.",
    "3": "Birth certificate + 2 copies.",
    "4": "Military service completion certificate + a copy.",
    "5": "Employer's approval of the applicant's professional study.",
    "6": "6 personal photos.",
    "7": "Two plastic files.",
    "8": "1 pound stamp.",
    "9": "50L.E envelope withdrawal.",
    "10": "Tuition fees.",
    "11": "Registration in the diploma will only be accepted after fulfilling the conditions and documents mentioned."
  },
  "libraryServices": {
    "1": "Traditional information sources.",
    "2": "Traditional periodicals.",
    "3": "Searching databases and information networks electronically.",
    "4": "Electronic periodicals.",
    "5": "Relationships with local publishers.",
    "6": "Photography and reproduction.",
    "7": "Ongoing briefing.",
    "8": "Email and Internet.",
    "9": "Reference services.",
    "10": "Technical training for beneficiaries.",
    "11": "Guidance for students in using the library facilities."
  },
  "availableCourses": {
    "1": "Search Engines",
    "2": "Microsoft PowerPoint",
    "3": "Microsoft Word.",
    "4": "Search Excel",
    "5": "Endnote",
    "6": "Microsoft Excel",
    "7": "Web-Authorizing using Dream Weaver.",
    "8": "Plagiarism checker and avoidance"
  },
  "assistant": {
    "name": "Smart Assistant",
    "message": "Hello, I'm your smart assistant. How can I help you?",
    "placeholder": "Type message here",
    "typing": "Your assistant is typing..."
  },
  "receipts": {
    "semester": "First Semester 2022/2023",
    "creditHrs": "Number of Credit Hours",
    "annual": "Annual Fees",
    "retake": "Retake Fees",
    "per": "50 per Subject",
    "book": "Book Fees",
    "totalFees": "Total Fees",
    "print": "Print",
    "EGP": "EGP",
    "hrs": "Hours",
    "pay": "Pay"
  },
  "error": {
    "pwd": "Please enter a valid password",
    "pwdConf": "Password and confirm password must match",
    "conf": "Please enter a valid confirm password",
    "courseOcc": "Course already registered",
    "timeReserved": "Time slot already reserved",
    "classes": "Error fetching classes",
    "tableData": "Error fetching table data"
  },
  "quiz": {
    "remainingTime": "Remaining Time",
    "givenTime": "Given Time",
    "totalMarks": "Total Marks",
    "submit": "Submit",
    "next": "Next",
    "hour": "Hour",
    "hours": "Hours",
    "minute": "Minute",
    "minutes": "Minutes",
    "noQuiz": "No Quizzes Available..."
  },
  "chat": {
    "searchName": "Search by name..."
  }
}
