{
  "common": {
    "app_title": "Admin Version",
    "unauthorized_main": "Unauthorized!",
    "unauthorized_secondary": "You are being redirected to another page...",
    "redirecting_main": "Please Hold On!",
    "notfound_main": "Oops!",
    "notfound_secondary": "Error 404: Page Not Found",
    "notfound_button": "Back To Home",
    "language": "Language",
    "religion": "Religion",
    "religion_christian": "Christian",
    "religion_muslim": "Muslim",
    "login": "Sign In",
    "logout": "Sign Out",
    "edit": "Edit",
    "add": "Add",
    "delete": "Delete",
    "save": "Save",
    "cancel": "Reset",
    "loading": "Loading",
    "nodata": "No Data to show",
    "nosearch": "No Search Results",
    "level1": "Level 1",
    "select": "Choose an Option",
    "future": "Future Work",
    "eng_name": "English Name",
    "ar_name": "Arabic Name",
    "firstTerm": "First Semester",
    "secondTerm": "Second Semester",
    "summerTerm": "Summer Semester",
    "gpaFrom": "GPA From ",
    "gpaTo": "GPA To",
    "choice_yes": "Yes",
    "choice_no": "No",
    "lecture": "Lecture",
    "lab": "Lab",
    "section": "Section",
    "day": "Day",
    "period": "Period",
    "time": "Time",
    "search": "Search..",
    "continue": "Continue",
    "gender": "Gender",
    "gender_male": "Male",
    "gender_female": "Female",
    "birthplace": "Birthplace",
    "birthdate": "Birthdate",
    "nationality": "Nationality",
    "otherNationality": "Other Nationality",
    "nationalId": "National ID",
    "marital": "Marital Status",
    "marital_single": "Single",
    "marital_married": "Married",
    "marital_divorced": "Divorced",
    "marital_widowed": "Widowed",
    "marital_separated": "Separated",
    "address": "Address",
    "phone": "Phone Number",
    "homeNumber": "Home Number",
    "directorate": "Directorate",
    "guardianName": "Guardian Name",
    "guardianPhone": "Guardian Phone Number",
    "guardianAddress": "Guardian Address",
    "guardianNationality": "Guardian Nationality",
    "prevQualification": "Previous Qualification",
    "prevQualificationInstitute": "Previous Qualification Institute",
    "enrollmentYear": "Enrollment Year",
    "enrollmentEndDate": "Enrollment End Date",
    "totalPrevQualification": "Total Previous Qualification",
    "recruitmentState": "Recruitment State",
    "recruitmentNumber": "Recruitment Number",
    "recruitmentDate": "Recruitment Date",
    "armyNumber": "Army Number",
    "schoolMarks": "School Marks",
    "schoolSeat": "Seat ID",
    "regCourses": "Registered Courses",
    "addCourse": "Add Course",
    "editCourse": "Edit Course",
    "coursesNotReg": "Courses Not Registered",
    "enterValue": "Enter a Value..",
    "invalidCred": "Invalid Credentials"
  },
  "login": {
    "email": "E-mail",
    "password": "Password",
    "forget": "Forgot Your Password?",
    "title": "Welcome To Suez Canal University",
    "button": "login",
    "subtitle": "LOGIN"
  },
  "reset": {
    "new-pswrd": "New Password",
    "conf-pswrd": "Confirm Password",
    "button": "Reset",
    "subtitle": "Reset Password"
  },
  "forget": {
    "email": "E-mail",
    "button": "Send",
    "subtitle": "Forgot Your Password?"
  },
  "week": {
    "saturday": "Saturday",
    "sunday": "Sunday",
    "monday": "Monday",
    "tuesday": "Tuesday",
    "wednesday": "Wednesday",
    "thursday": "Thursday",
    "friday": "Friday"
  },
  "levels": {
    "0": "Level 1",
    "1": "Level 2",
    "2": "Level 3",
    "3": "Level 4",
    "4": "Level 5"
  },
  "staff": {
    "container-1-title":"Induction",
    "container-1-text":"The induction event/session is your start point in the process of becoming familiar with, and settling into, University life. During your induction session you will be introduced to your workplace, team, and supervisors. you will be informed with your duties and schedules. Also, you will be handed your ID card, username, and passwords of the professors-related digital platforms. Your induction session is your opportunity to investigate, to ask questions, and to introduce yourself to the employees. Always feel free to explore your environment, and ask for help if needed.",
    "container-2-title":"Accommodation / Staff Housing",
    "container-2-text":"Suez Canal University provides the academic staff with housing services. The service is manifested in the tutors Lounge located in El-Sheikh Zayed district next to the International Swimming pool in in Ismailia. The lounge consists of 2 blocks that have a total of 45 rooms with a housing capacity of 180 residents. To qualify for admission, applicants must complete all secondary school graduation requirements, maintain a high level of academic performance and submit all required documents before the set deadlines. Having the minimum academic requirements does not guarantee admission to the University, but rather ensures entry to the selection process. There is a minimum level of academic achievement for each faculty that is decided by the supreme council of universities each year.",
    "container-3-title":"How To Apply",
    "container-3-text":"The Library aspires to be the main source of intellectual and civilized knowledge, with its sources of information in science and culture as well as its material and human capabilities and support services in the advancement of knowledge and research movement and the development of the educational process. Library services:\n- Traditional information sources.\n - Traditional periodicals.\n- Searching databases and information networks electronically.\n- Electronic periodicals.\n- Relationships with local publishers.\n- Photography and reproduction.\n- Ongoing briefing.\n- Email and Internet.\n- Reference services.\n- Technical training for beneficiaries.\n- Guidance for students in using the library facilities.",
    "container-4-title":"Professional development",
    "container-4-text":"Available courses:\n- Search Engines\n- Microsoft PowerPoint\n- Microsoft Word.\n- Search Excel\n- Endnote\n- Microsoft Excel\n- Web-Authorizing using Dream Weaver.\n- Plagiarism checker and avoidance"
  },
  "undergraduate": {
    "container-1-text":"Suez Canal University is the leading educational and research institution in the Canal Region. Our academic status of glory has not been earned/accomplished overnight. As the university, since its establishment, has been more than keen to offer its attendees an outstanding opportunity to learn, develop, and succeed. Suez Canal University has recruited both of its campuses, the old and new ones, to support its mission and vision of continuous learning.SCU has the doors wide open for both the national and international students to join in for either a bachelor’s degree or postgraduate degree. The scope of learning is not limited to undergraduate education. On the contrary, it has extended to include postgraduate education as well, making Suez Canal University an Egyptian educational institution of remarkable variation in the offered levels of education and the awarded certificates.We aim to offer our students value, knowledge, and scientific power to make a positive change in the world. No matter what your scope of study is, your major subject or interest might be, you will find the right program for you, as SCU has 20 faculties operating on its campus.",
    "container-2-title":"Diploma Conditions ",
    "container-2-text":"The student must hold a bachelor's degree from one of the universities recognized by the supreme council of universities.\nThe student must meet the conditions of admission as well as the department's approval.\nThe student must submit a hard copy of the required documents at the administration's building and then submit a soft copy through the admission from on the website.\nThe student selects the appropriate courses and updates the registration form, then passes it to the academic advisor and the head of the specialized scientific department for accreditation. Eventually, the vice dean for postgraduate studies and research approves of the form.\nIf the student meets the admission criteria, he/she will not be admitted until the tuition fees are paid.\nPayment of tuition fees is a must for the student to be allowed to attend and record courses.\nA student who still has not selected his/her courses of study after the last week of the spring semester and the first week of the summer semester will not be allowed to attend lectures.\nThe institute/faculty council may, on the recommendation of the department council, accept the registration of a student who holds a bachelor's degree in a specialization not related to the department after passing several supplementary courses at the Bachelor level established by the competent section board.\nIf the number of the assigned courses exceeds four, the institute/faculty will offer the student a preparatory year for qualification. The year will not be counted among the official years of study.",
    "container-3-title":"Required Documents",
    "container-3-text":"Bachelor's degree certificate + a copy.\nCertificate of subject's grades + a copy.\nBirth certificate + 2 copies.\nMilitary service completion certificate + a copy.\nEmployer's approval of the applicant's professional study.\n6 personal photos.\nTwo plastic files.\n1 pound stamp.\n50L.E envelope withdrawal.\nTuition fees.\nRegistration in the diploma will only be accepted after fulfilling the conditions and documents mentioned."

  }

}
